# Python3 注释
# 确保对模块, 函数, 方法和行内注释使用正确的风格
# Python中的注释有单行注释和多行注释：
# Python中单行注释以 # 开头，例如：：
# # 这是一个注释
# print("Hello, World!") 
# 多行注释用三个单引号 ''' 或者三个双引号 """ 将注释括起来，例如:
# 1、单引号 3 个
#!/usr/bin/python3 
'''
这是多行注释，用三个单引号
这是多行注释，用三个单引号 
这是多行注释，用三个单引号
'''
print("Hello, World!") 
# 2、双引号 3 个
#!/usr/bin/python3 
"""
这是多行注释，用三个双引号
这是多行注释，用三个双引号 
这是多行注释，用三个双引号
"""
# print("Hello, World!") 
# Python3 解释器 Python3 运算符
# 以下实例我们可以输出函数的注释：
# def a():
#     '''这是文档字符串'''
#     pass
# print(a.__doc__)
# 输出结果为：
# 这是文档字符串